artifacts/wsdl/authentication.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
             xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.second.webservice.kth.se/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="http://service.second.webservice.kth.se/" name="Authentication">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://service.second.webservice.kth.se/"
                        schemaLocation="http://localhost:9091/authentication?xsd=1"></xsd:import>
        </xsd:schema>
    </types>
    <message name="login">
        <part name="parameters" element="tns:login"></part>
    </message>
    <message name="loginResponse">
        <part name="parameters" element="tns:loginResponse"></part>
    </message>
    <message name="testingHeaders">
        <part name="parameters" element="tns:testingHeaders"></part>
        <part name="token" element="tns:token"></part>
    </message>
    <message name="testingHeadersResponse">
        <part name="result" element="tns:testingHeadersResponse"></part>
    </message>
    <portType name="Authentication">
        <operation name="login">
            <input wsam:Action="http://service.second.webservice.kth.se/Authentication/loginRequest"
                   message="tns:login"></input>
            <output wsam:Action="http://service.second.webservice.kth.se/Authentication/loginResponse"
                    message="tns:loginResponse"></output>
        </operation>
        <operation name="testingHeaders" parameterOrder="parameters token">
            <input wsam:Action="http://service.second.webservice.kth.se/Authentication/testingHeadersRequest"
                   message="tns:testingHeaders"></input>
            <output wsam:Action="http://service.second.webservice.kth.se/Authentication/testingHeadersResponse"
                    message="tns:testingHeadersResponse"></output>
        </operation>
    </portType>
    <binding name="AuthenticationPortBinding" type="tns:Authentication">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
        <operation name="login">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal"></soap:body>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
        <operation name="testingHeaders">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" parts="parameters"></soap:body>
                <soap:header message="tns:testingHeaders" part="token" use="literal"></soap:header>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="Authentication">
        <port name="AuthenticationPort" binding="tns:AuthenticationPortBinding">
            <soap:address location="http://localhost:9091/authentication"></soap:address>
        </port>
    </service>
</definitions>